app/controllers/messages_controller.rb

SELECT `upload_messages`.* FROM `upload_messages` WHERE (isselected=1) ORDER BY id desc
---
  def upload_message
    if (session["imagefile"] != nil) then
      @imgf = session["imagefile"]
    else
      @imgf = ""
    end

    @strmessage = UploadMessage.find(:all, :conditions => "isselected=1", :order => "id desc")

INSERT INTO `upload_messages` (`created_at`, `image`, `message`, `updated_at`, `uploadtime`) VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 09 Jan 2012 08:38:09 UTC +00:00], ["image", ""], ["message", "sssss"], ["updated_at", Mon, 09 Jan 2012 08:38:09 UTC +00:00], ["uploadtime", ""]]
SELECT `upload_messages`.* FROM `upload_messages` WHERE `upload_messages`.`id` = ? LIMIT 1  [["id", "20\r\n"]]
UPDATE `upload_messages` SET `message` = 'ammount', `isselected` = 0, `updated_at` = '2012-01-17 05:07:27' WHERE `upload_messages`.`id` = 20
---
  def save_update
    @strmessage = params[:strmes]
    @strimage = params[:strimg]
    @struploadtime = Time.now+5*60
    @strusername = "eric_yue"
    @strid = params[:strid]
    if !@strmessage.blank? && !@strimage.blank? then
      UploadMessage.create({:message => @strmessage, :image => @strimage, :isselected => 1, :uploadtime => @struploadtime, :username => @strusername })
      #redirect_to "/messages/test_message"
      #Delayed::Job.enqueue(Jobsmessage.new(@strmessage,@strimage),3, 1.minute.from_now)
    else
      if !@strmessage.blank?
        UploadMessage.create({:message => @strmessage, :isselected => 1, :uploadtime => @struploadtime, :username => @strusername })
      end
    end

    if !@strid.blank? then
      str = @strid.split(",")
      str.each do |strid|
        messupdate = UploadMessage.find(strid)
        messupdate.update_attributes({:message => "ammount", :isselected => 0})